; domain
(define (domain rescue-drone)

    (:requirements :strips :negative-preconditions)

    (:predicates
        (drone-location ?d) ; Represents that the drone is at location ?d
        (person-location ?p ?d) ; Represents that the person ?p is at location ?d
        (obstacle ?d) ; Represents that there is an obstacle at location ?d
        (safe-zone ?d) ; Represents that location ?d is the safe zone
        (adjacent ?d1 ?d2) ; Represents that locations ?d1 and ?d2 are adjacent
        (rescued ?p) ; Represents that the person p has been rescued and is now in the safe zone
        (on-drone ?p) ; Represents that the person p is on the drone
        (drone-occupied); represents that the drone is currently carrying someone
        (spot ?s) ; Represents a valid spot in the safe zone
        (free-spot ?s) ; Represents that the spot ?s in the safe zone is free
    )

    (:action move
        :parameters (?d1 ?d2)

        :precondition (and
            (adjacent ?d1 ?d2)
            (not (obstacle ?d2))
            (drone-location ?d1)
        )

        :effect (and
            (drone-location ?d2)
            (not (drone-location ?d1))
        )
    )

    (:action pick-up
        :parameters (?p ?d)

        :precondition (and
            (person-location ?p ?d)
            (not (rescued ?p))
            (drone-location ?d)
            (not (drone-occupied))
        )

        :effect (and
            (on-drone ?p)
            (not (person-location ?p ?d))
            (drone-occupied)
        ) ; Note the we don't consider the person position to be d after being picked up.
    )

    (:action drop-off
        :parameters (?p ?sd ?s) ; sd for safe-zone position, s for spot

        :precondition (and
            (on-drone ?p)
            (safe-zone ?sd)
            (drone-location ?sd)
            (free-spot ?s)
            (spot ?s)
        )

        :effect (and
            (rescued ?p)
            (not (on-drone ?p))
            (not (drone-occupied))
            (not (free-spot ?s))
        )
    )

    ; Free a spot in the safe zone
    (:action free-safe-zone
        :parameters (?s)

        :precondition (and
            (not (free-spot ?s))
            (spot ?s)
        )

        :effect (free-spot ?s)
    )
)

; problem
(define (problem rescue-drone-problem-5x5)
    (:domain rescue-drone)

    (:objects
        d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12 d13 d14 d15 d16 d17 d18 d19 d20 d21 d22 d23 d24 d25 ; Locations
        p1 p2 p3 p4 p5 ; Persons
        s1 s2 s3 s4 ; Spots
        )

    (:init
        (drone-location d25)
        (person-location p1 d1)
        (person-location p2 d5)
        (person-location p3 d11)
        (person-location p4 d15)
        (person-location p5 d23)
        (safe-zone d13)

        ;; Define adjacencies for a 5x5 grid
        (adjacent d1 d2)
        (adjacent d1 d6)
        (adjacent d2 d1)
        (adjacent d2 d3)
        (adjacent d2 d7)
        (adjacent d3 d2)
        (adjacent d3 d4)
        (adjacent d3 d8)
        (adjacent d4 d3)
        (adjacent d4 d5)
        (adjacent d4 d9)
        (adjacent d5 d4)
        (adjacent d5 d10)

        (adjacent d6 d1)
        (adjacent d6 d7)
        (adjacent d6 d11)
        (adjacent d7 d2)
        (adjacent d7 d6)
        (adjacent d7 d8)
        (adjacent d7 d12)
        (adjacent d8 d3)
        (adjacent d8 d7)
        (adjacent d8 d9)
        (adjacent d8 d13)
        (adjacent d9 d4)
        (adjacent d9 d8)
        (adjacent d9 d10)
        (adjacent d9 d14)
        (adjacent d10 d5)
        (adjacent d10 d9)
        (adjacent d10 d15)

        (adjacent d11 d6)
        (adjacent d11 d12)
        (adjacent d11 d16)
        (adjacent d12 d7)
        (adjacent d12 d11)
        (adjacent d12 d13)
        (adjacent d12 d17)
        (adjacent d13 d8)
        (adjacent d13 d12)
        (adjacent d13 d14)
        (adjacent d13 d18)
        (adjacent d14 d9)
        (adjacent d14 d13)
        (adjacent d14 d15)
        (adjacent d14 d19)
        (adjacent d15 d10)
        (adjacent d15 d14)
        (adjacent d15 d20)

        (adjacent d16 d11)
        (adjacent d16 d17)
        (adjacent d16 d21)
        (adjacent d17 d12)
        (adjacent d17 d16)
        (adjacent d17 d18)
        (adjacent d17 d22)
        (adjacent d18 d13)
        (adjacent d18 d17)
        (adjacent d18 d19)
        (adjacent d18 d23)
        (adjacent d19 d14)
        (adjacent d19 d18)
        (adjacent d19 d20)
        (adjacent d19 d24)
        (adjacent d20 d15)
        (adjacent d20 d19)
        (adjacent d20 d25)

        (adjacent d21 d16)
        (adjacent d21 d22)
        (adjacent d22 d17)
        (adjacent d22 d21)
        (adjacent d22 d23)
        (adjacent d23 d18)
        (adjacent d23 d22)
        (adjacent d23 d24)
        (adjacent d24 d19)
        (adjacent d24 d23)
        (adjacent d24 d25)
        (adjacent d25 d20)
        (adjacent d25 d24)

        ;; Obstacles
        (obstacle d6)
        (obstacle d7)
        (obstacle d8)
        (obstacle d9)

        (obstacle d17)
        (obstacle d18)
        (obstacle d19)
        (obstacle d20)

        ;; Safe-zone spots
        (spot s1)
        (spot s2)
        (spot s3)
        (spot s4)
        (free-spot s1)
        (free-spot s2)
        (free-spot s3)
        (free-spot s4)
    )

    (:goal
        (and
            (rescued p1)
            (rescued p2)
            (rescued p3)
            (rescued p4)
            (rescued p5)
        )
    )
)

; plan
1. (move d25 d24)
   deleted: (drone-location d25)
   added: (drone-location d24)
   goals met: 0 of 5
2. (move d24 d23)
   deleted: (drone-location d24)
   added: (drone-location d23)
   goals met: 0 of 5
3. (pick-up p5 d23)
   deleted: (person-location p5 d23)
   added: (on-drone p5) (drone-occupied)
   goals met: 0 of 5
4. (move d23 d22)
   deleted: (drone-location d23)
   added: (drone-location d22)
   goals met: 0 of 5
5. (move d22 d21)
   deleted: (drone-location d22)
   added: (drone-location d21)
   goals met: 0 of 5
6. (move d21 d16)
   deleted: (drone-location d21)
   added: (drone-location d16)
   goals met: 0 of 5
7. (move d16 d11)
   deleted: (drone-location d16)
   added: (drone-location d11)
   goals met: 0 of 5
8. (move d11 d12)
   deleted: (drone-location d11)
   added: (drone-location d12)
   goals met: 0 of 5
9. (move d12 d13)
   deleted: (drone-location d12)
   added: (drone-location d13)
   goals met: 0 of 5
10. (drop-off p5 d13 s1)
   deleted: (on-drone p5) (drone-occupied) (free-spot s1)
   added: (rescued p5)
   goals met: 1 of 5
11. (move d13 d12)
   deleted: (drone-location d13)
   added: (drone-location d12)
   goals met: 1 of 5
12. (move d12 d11)
   deleted: (drone-location d12)
   added: (drone-location d11)
   goals met: 1 of 5
13. (pick-up p3 d11)
   deleted: (person-location p3 d11)
   added: (on-drone p3) (drone-occupied)
   goals met: 1 of 5
14. (move d11 d12)
   deleted: (drone-location d11)
   added: (drone-location d12)
   goals met: 1 of 5
15. (move d12 d13)
   deleted: (drone-location d12)
   added: (drone-location d13)
   goals met: 1 of 5
16. (drop-off p3 d13 s2)
   deleted: (on-drone p3) (drone-occupied) (free-spot s2)
   added: (rescued p3)
   goals met: 2 of 5
17. (move d13 d14)
   deleted: (drone-location d13)
   added: (drone-location d14)
   goals met: 2 of 5
18. (move d14 d15)
   deleted: (drone-location d14)
   added: (drone-location d15)
   goals met: 2 of 5
19. (move d15 d10)
   deleted: (drone-location d15)
   added: (drone-location d10)
   goals met: 2 of 5
20. (move d10 d5)
   deleted: (drone-location d10)
   added: (drone-location d5)
   goals met: 2 of 5
21. (move d5 d4)
   deleted: (drone-location d5)
   added: (drone-location d4)
   goals met: 2 of 5
22. (move d4 d3)
   deleted: (drone-location d4)
   added: (drone-location d3)
   goals met: 2 of 5
23. (move d3 d2)
   deleted: (drone-location d3)
   added: (drone-location d2)
   goals met: 2 of 5
24. (move d2 d1)
   deleted: (drone-location d2)
   added: (drone-location d1)
   goals met: 2 of 5
25. (pick-up p1 d1)
   deleted: (person-location p1 d1)
   added: (on-drone p1) (drone-occupied)
   goals met: 2 of 5
26. (move d1 d2)
   deleted: (drone-location d1)
   added: (drone-location d2)
   goals met: 2 of 5
27. (move d2 d3)
   deleted: (drone-location d2)
   added: (drone-location d3)
   goals met: 2 of 5
28. (move d3 d4)
   deleted: (drone-location d3)
   added: (drone-location d4)
   goals met: 2 of 5
29. (move d4 d5)
   deleted: (drone-location d4)
   added: (drone-location d5)
   goals met: 2 of 5
30. (move d5 d10)
   deleted: (drone-location d5)
   added: (drone-location d10)
   goals met: 2 of 5
31. (move d10 d15)
   deleted: (drone-location d10)
   added: (drone-location d15)
   goals met: 2 of 5
32. (move d15 d14)
   deleted: (drone-location d15)
   added: (drone-location d14)
   goals met: 2 of 5
33. (move d14 d13)
   deleted: (drone-location d14)
   added: (drone-location d13)
   goals met: 2 of 5
34. (drop-off p1 d13 s3)
   deleted: (on-drone p1) (drone-occupied) (free-spot s3)
   added: (rescued p1)
   goals met: 3 of 5
35. (move d13 d14)
   deleted: (drone-location d13)
   added: (drone-location d14)
   goals met: 3 of 5
36. (move d14 d15)
   deleted: (drone-location d14)
   added: (drone-location d15)
   goals met: 3 of 5
37. (move d15 d10)
   deleted: (drone-location d15)
   added: (drone-location d10)
   goals met: 3 of 5
38. (move d10 d5)
   deleted: (drone-location d10)
   added: (drone-location d5)
   goals met: 3 of 5
39. (pick-up p2 d5)
   deleted: (person-location p2 d5)
   added: (on-drone p2) (drone-occupied)
   goals met: 3 of 5
40. (move d5 d10)
   deleted: (drone-location d5)
   added: (drone-location d10)
   goals met: 3 of 5
41. (move d10 d15)
   deleted: (drone-location d10)
   added: (drone-location d15)
   goals met: 3 of 5
42. (move d15 d14)
   deleted: (drone-location d15)
   added: (drone-location d14)
   goals met: 3 of 5
43. (move d14 d13)
   deleted: (drone-location d14)
   added: (drone-location d13)
   goals met: 3 of 5
44. (drop-off p2 d13 s4)
   deleted: (on-drone p2) (drone-occupied) (free-spot s4)
   added: (rescued p2)
   goals met: 4 of 5
45. (free-safe-zone s1)
   added: (free-spot s1)
   goals met: 4 of 5
46. (move d13 d14)
   deleted: (drone-location d13)
   added: (drone-location d14)
   goals met: 4 of 5
47. (move d14 d15)
   deleted: (drone-location d14)
   added: (drone-location d15)
   goals met: 4 of 5
48. (pick-up p4 d15)
   deleted: (person-location p4 d15)
   added: (on-drone p4) (drone-occupied)
   goals met: 4 of 5
49. (move d15 d14)
   deleted: (drone-location d15)
   added: (drone-location d14)
   goals met: 4 of 5
50. (move d14 d13)
   deleted: (drone-location d14)
   added: (drone-location d13)
   goals met: 4 of 5
51. (drop-off p4 d13 s1)
   deleted: (on-drone p4) (drone-occupied) (free-spot s1)
   added: (rescued p4)
   goals met: 5 of 5
